Repository: windhamdavid/druproject
Catalog: sites/all/modules/db_maintenance/translations/*.po
Languages: hu

source: DB maintenance
hu: Adatbázis karbantartása

source: Optimize tables
hu: Táblák optimalizálása

source: Database tables optimized
hu: Az adatbázis tábláinak optimalizálása megtörtént.

source: If enabled, a watchdog entry will be made each time tables are optimized, containing information which tables were involved.
hu: Ha ez engedélyezett, akkor az optimalizált táblákról egy eseménynapló bejegyzés keletkezik, mely tartalmazza az érintett táblákat.

source: Hourly
hu: Óránként

source: Daily
hu: Naponta

source: Weekly
hu: Hetente

source: Monthly
hu: Havonta

source: Select how often database tables should be optimized.
hu: A táblák optimalizálási gyakoriságának kiválasztása.

source: Optimize now.
hu: Optimalizálás most.

source: Tables in the !db database
hu: !db database táblái

source: Selected tables will be optimized during cron runs.
hu: A kiválasztott táblák optimalizálva lesznek az időzített feladatok során.

source: <p>DB maintenance performs an optimization query on selected tables.</p> <p>For MyISAM tables, OPTIMIZE TABLE repairs a table if it has deleted or split rows, sorts table indexes, and updates table statistics. For BDB and InnoDB, OPTIMIZE rebuilds the table. Note, MySQL locks tables during the time OPTIMIZE TABLE is running. OPTIMIZE works best on tables with large deletions (e.g. cache or watchdog), however MySQL will reuse old record positions, therefore in most setups, OPTIMIZE TABLE is unnecessary unless you just like defragmenting.</p> <p>The Overhead column in phpMyAdmin's database view is the most common way to determine the need of an OPTIMIZE TABLE query. It essentially shows the amount of disk space you would recover by running an optimize/defragmentation query.</p> <p>For PostgreSQL tables, VACUUM reclaims storage occupied by deleted tuples. In normal PostgreSQL operation, tuples that are deleted or obsoleted by an update are not physically removed from their table; they remain present until a VACUUM is done. Therefore it's necessary to do VACUUM periodically, especially on frequently-updated tables.</p>
hu: <p>Az adatbázis karbantartó egy optimalizáló utasítást futtat a kiválasztott táblákon..</p> <p>A MyISAM táblákat az OPTIMIZE TABLE helyreállítja, ha vannak benne törölt vagy töredezett sorok, újrarendezi a tábla indexeit, és frissíti a tábla statisztikáját. A BDB és InnoDB táblákon az OPTIMIZE újraépíti a táblát. Megjegyzendő, hogy a MySQL zárolja a táblákat arra az időre, amíg az OPTIMIZE TABLE fut. Az OPTIMIZE a legjobban azokon a táblákon működik, melyek sok törölt rekorddal rendelkeznek (például a cache vagy a watchdog), azonban a MySQL újra a régi rekordpoziciókat fogja használni, ezért a legtöbb beállításban az OPTIMIZE TABLE csak mint töredezettségmentesítő szükséges.</p> <p>Az OPTIMIZE TABLE futtatásának szükségességát a legtöbbször a phpMyAdmin adatbázisnézetének felülírás oszlopa mutatja meg. Ez lényegében megmutatja azt a visszanyerhető lemezterületet, melyet egy optimalizálással, vagy töredezettségmentesítéssel vissza lehet nyerni.</p> <p>A PostgreSQL táblákon a VACUUM visszanyeri a törölt sorok miatt elveszett területet. A normál PostgreSQL műveletek során a törölt, vagy felülírás miatt érvényét vesztett sorok nem törlődnek fizikailag a táblából, hanem jelen maradnak mindaddíg, amíg egy VACUUM le nem fut. Ezért szükséges időközönként a VACUUM utasítást végrehajtani, különösen a gyakran frissített táblákon.</p>

source: Executes an optimization query on database tables during cron runs.
hu: Optimalizáló utasítást futtat az adatbázis táblákon az időzített feladatok során.

source: Run during every cron
hu: Futtatás minden időzített feladat során

source: Bi-Hourly
hu: Kétóránként

source: Bi-Daily
hu: Kétnaponta

source: Bi-Weekly
hu: Kéthetente

source: Bi-Monthly
hu: Kéthavonta

source: @table table in @db database was configured to be optimized but does not exist.
hu: @db adatbázis @table táblája be van állítva az optimalizáláshoz, de nem létezik.

source: Optimized @table table in @db database.
hu: @table tábla @db adatbázisban optimalizálva lett.

source: Optimized tables in @db database: @tables
hu: @db adatbázisban optimalizált táblák: @tables

source: Executes a cron-based query to optimize database tables.
hu: Időzített feladatonként utasítást futtat az adatbázis tábláinak optimalizálásához.

source: Executes an OPTIMIZE TABLE query on MyISAM, InnoDB, or BerkeleyDB database tables in a MySQL database.
hu: Egy OPTIMIZE TABLE utasítást futtat a MyISAM, InnoDB, vagy BerkeleyDB típusú adatbázis táblákra egy MySQL adatbázisban.
