Repository: windhamdavid/druproject
Catalog: sites/all/modules/vocabindex/translations/*.po
Languages: es

source: Character transliteration
es: Transliteración de caracteres

source: Group terms by the <a href="!wiki_latin_alphabet">modern Latin</a> equivalent of their first letter for alphabetical views. <a href="!transliteration_info">More information</a>.
es: Agrupar términos según el equivalente en <a href="!wiki_latin_alphabet">alfabeto latino</a> de su primera letra para vistas alfabéticas. <a href="!transliteration_info">Más información</a>.

source: Terms per page
es: Términos por página

source: The amount of terms to display per page for browsable and alphabetical views. Use 0 to disable paging.
es: El número de términos a mostrar por cada página para vistas explorables o alfabéticas. Usar 0 para deshabilitar la paginación.

source: Caching
es: Caché

source: Cache lifetime
es: Duración de la caché

source: Specified in minutes. Use 0 to disable caching or if you are using a Taxonomy access control module.
es: Especificada en minutos. Usar 0 para deshabilitar la caché o si se está usando un módulo de control de acceso a taxonomía.

source: Clear cache
es: Borrar la caché

source: The cache has been cleared.
es: La caché ha sido borrada.

source: %element_title may only contain numbers.
es: %element_title sólo puede contener números.

source: Paths may not contain a percentage sign.
es: Las rutas (paths) no pueden contener un signo de porcentaje.

source: Path is already used by a menu link.
es: La ruta (path) ya está siendo usada por un enlace de menú.

source: Path is already used as an alias.
es: La ruta (path) ya está siendo usada como un alias.

source: You haven't yet got any vocabularies to enable an index for; you may create them at <a href="!link">the Taxonomy page</a>.
es: Todavía no hay ningún vocabulario para el que habilitar un índice; se puede crear uno en <a href="!link">la página de Taxonomía</a>.

source: Currently located at !location.
es: Actualmente ubicado en !location.

source: There is no index page set for this vocabulary.
es: No se ha establecido una página índice para este vocabulario.

source: Tree
es: Árbol

source: Browsable
es: Explorable

source: Alphabetical
es: Alfabética

source: Flat
es: Plana

source: Save configuration
es: Guardar configuración

source: The configuration options have been saved.
es: Las opciones de configuración se han guardado.

source: There are currently no terms in this vocabulary.
es: Actualmente no hay ningún término en este vocabulario.

source: Vocabulary Index has been enabled. Please proceed to <a href="!settings">the settings page</a> and <a href="!permissions">set up the permissions</a> to get started.
es: Vocabulary Index se ha habilitado. Véase a continuación <a href="!settings">la página de configuración</a> y <a href="!permissions">la página de permisos</a> para empezar a usarlo.

source: Administer Vocabulary Index
es: Administrar Vocabulary Index

source: Configure Vocabulary Index pages, blocks and general settings.
es: Configurar páginas de Vocabulary Index, bloques y opciones generales.

source: View index pages
es: Ver páginas índice

source: View Vocabulary Index pages.
es: Ver páginas de Vocabulary Index

source: Vocabulary Index provides several ways to list all terms inside a specified vocabulary. For each vocabulary you may enable a <a href="!url_pages">page</a> and/or a <a href="!url_blocks">block</a> that will view its terms in the way you think suits best. This way may be a tree, a flat, browsable index, or an index where you can filter terms by letter. Next to that you can choose to display node counts for each term. Term descriptions will be displayed along with the term names if provided.
es: Vocabulary Index proporciona varias maneras de listar todos los términos contenidos en un vocabulario específico. Para cada vocabulario se puede habilitar una <a href="!url_pages">página</a> y/o un <a href="!url_blocks">bloque</a> que mostrará sus términos del modo que se requiera en cada ocasión. Este modo puede ser un índice de árbol, plano o explorable, o un índice donde se pueden filtrar los términos alfabéticamente. Además se puede elegir mostrar el conteo de nodos para cada término. Las descripciones de término se mostrarán junto con los nombres de término, si las hay.

source: Configuration
es: Configuración

source: You may want to execute the following steps to configure Vocabulary Index.
es: Pueden darse los siguientes pasos para configurar Vocabulary Index.

source: Set up <a href="!permissions">permissions</a>.
es: Establecer <a href="!permissions">permisos</a>.

source: Create <a href="!index_pages">index pages</a>.
es: Crear <a href="!index_pages">páginas índice</a>.

source: Create <a href="!index_blocks">index blocks</a>.
es: Crear <a href="!index_blocks">bloques índice</a>.

source: Configuration step not completed.
es: El paso de configuración no se ha completado.

source: Example screenshot of a tree view.
es: Captura de pantalla de una vista de árbol.

source: Example screenshot of a browsable view.
es: Captura de pantalla de una vista explorable.

source: Example screenshot of an alphabetical view.
es: Captura de pantalla de una vista alfabética.

source: The <strong>tree view</strong> displays all terms in a nested tree. If visitors of your site have JavaScript enabled, parent terms will be collapsed by default, but they will expand when clicked on. Since tree view displays all terms on a single page, terms with multiple parents are displayed more than once: once beneath every parent.
es: La <strong>vista de árbol</strong> muestra todos los términos en un árbol anidado. Si los visitantes del sitio tienen JavaScript habilitado, los términos padre se contraerán por defecto, pero se expandirán al hacer clic en ellos. Ya que la vista de árbol muestra todos los términos en una sola página, los términos con varios padres se muestran más de una vez: una vez debajo de cada padre.

source: The <strong>browsable view</strong> lets visitors browse a vocabulary much like they would browse through directories on their hard drive. Taxonomy pages of parent terms do not list the nodes within those terms, but the child terms it contains. Since blocks cannot span multiple pages, they can be displayed using a flat view. This is exactly the same as the browsable view apart from that it is not browsable. Browsable index pages are <a href="!settings_page">pageable</a>.
es: La <strong>vista explorable</strong> permite a los visitantes explorar un vocabulario de manera similar a como explorarían carpetas en su disco duro. Las páginas de Taxonomía de términos padre no listan los nodos contenidos en dichos términos, sino los términos hijo que contiene. Ya que los bloques no pueden dividirse en varias páginas, pueden ser mostrados usando una vista plana. Ésta es exactamente igual que la vista explorable en todo salvo en que no es explorable. Las páginas índice explorables admiten <a href="!settings_page">paginación</a>.

source: The <strong>alphabetical view</strong> sorts terms by first letter. Optionally <a href="#transliteration">character transliteration</a> may be enabled. Alphabetically viewed index pages are <a href="!settings_page">pageable</a>.
es: La <strong>vista alfabética</strong> ordena los términos según su primera letra. Opcionalmente se puede habilitar la <a href="#transliteration">transliteración de caracteres</a>. Las páginas indice de vista alfabética admiten <a href="!settings_page">paginación</a>.

source: For more extensive information on configuring Vocabulary Index or on development, please visit <a href="!handbook_page">the on-line handbook</a>.
es: Para una mayor información sobre la configuración o el desarrollo de Vocabulary Index, véase <a href="!handbook_page">el manual de referencia en línea</a> (en inglés).

source: Character transliteration groups terms by the <a href="!wiki_latin_alphabet">modern Latin</a> equivalent of their first letter for the alphabetical view. This way terms like <em>Ångström</em> and <em>Ampère</em> will both be grouped under the letter A, for instance. If you would like to modify the <a href="!default_file">default transliteration file</a>, copy the file to <em>i18n-ascii-custom.txt</em> and use this file instead to override the values from i18n-ascii.txt or to add new values.
es: La transliteración de caracteres agrupa términos según el equivalente en <a href="!wiki_latin_alphabet">alfabeto latino</a> de su primera letra para vistas alfabéticas. De este modo términos como <em>Ångström</em> y <em>Ampère</em> se agruparán ambos bajo la letra A, por ejemplo. Para modificar <a href="!default_file">el archivo de transliteración original</a>, hacer una copia del archivo llamada <em>i18n-ascii-custom.txt</em> y utilizar esta copia en lugar de modificar los valores de i18n-ascii.txt o de añadirle valores nuevos.

source: Other contributed modules
es: Otros módulos de contribuyentes

source: Some other modules, like <a href="!pathauto_project_page">Pathauto</a>, complement Vocabulary Index. For instructions on setting up these modules to work with Vocabulary Index, please visit <a href="!handbook_complementary_modules">the on-line handbook</a>.
es: Algunos otros módulos, como <a href="!pathauto_project_page">Pathauto</a>, complementan a Vocabulary Index. Para obtener instrucciones sobre cómo configurar estos módulos para trabajar con Vocabulary Index, véase <a href="!handbook_complementary_modules">el manual en línea</a> (en inglés).

source: Index pages list the terms inside a vocabulary. They are accessible by a path of their own and they are enabled as soon as you enter one.
es: Las páginas índice listan los términos que contiene un vocabulario. Se accede a ellas mediante una ruta (path) propia y se habilitan en el momento en que se introduce una.

source: Index blocks list the terms inside a vocabulary. Enabled blocks can be configured at the <a href="!blocks">blocks settings page</a>. Flat index blocks are similar to browsable pages, they only differ in that they are not browsable and therefore don't display nested terms.
es: Los bloques índice listan los términos que contiene un vocabulario. Los bloques habilitados se pueden configurar en la <a href="!blocks">página de configuración de bloques</a>. Los bloques índice planos son similares a las páginas explorables, difieren solamente en que no son explorables y por tanto no muestran términos anidados.

source: administer vocabulary index
es: administrar índice de vocabulario

source: title
es: título

source: description
es: descripción

source: view vocabulary index
es: ver índice de vocabulario

source: Create index pages for vocabularies.
es: Crear páginas índice para vocabularios.

source: Pages
es: Páginas

source: Blocks
es: Bloques

source: Create index blocks for vocabularies.
es: Crear bloques índice para vocabularios.

source: Settings
es: Opciones

source: General settings.
es: Opciones generales.

source: The table in which the settings for Vocabulary Index are stored.
es: La tabla en la que la configuración de Vocabulary Index se guarda.

source: The VID associated with this index.
es: La VID asociada con este índice.

source: The path to a Vocabulary Index page.
es: La ruta (path) a una página de Vocabulary Index.

source: The view, a tree or a flat list for instance.
es: La vista, por ejemplo una lista de árbol o plana.

source: Whether to count nodes per term.
es: Contar o no los nodos de cada término.

source: Index page or index block.
es: Página índice o bloque índice.

source: Indicates whether this index is enabled or not.
es: Indica si este índice está habilitado o no.

source: Easily browse through taxonomy. Display vocabularies like trees, a directory index or sort their terms alphabetically.
es: Para explorar la taxonomía de forma cómoda. Mostrar vocabularios como árboles, un índice de carpetas, u organizar sus términos alfabéticamente.

source: Vocabulary
es: Vocabulario

source: View
es: Vista

source: Node counts
es: Conteo de nodos

source: Path
es: Ruta (path)

source: Enabled
es: Habilitado
